zmzdh/CAN_st_test/Drivers/Drivers/FM33FG0xxA_FL_Driver/Inc/fm33fg0xxa_fl_cmu.h
#define    CMU_IER_LFDET_IE_Pos                                   (0U)
#define    CMU_IER_LFDET_IE_Msk                                   (0x1U << CMU_IER_LFDET_IE_Pos)
#define    CMU_IER_LFDET_IE                                       CMU_IER_LFDET_IE_Msk

#define    CMU_ISR_HFDETO_Pos                                     (9U)
#define    CMU_ISR_HFDETO_Msk                                     (0x1U << CMU_ISR_HFDETO_Pos)
#define    CMU_ISR_HFDETO                                         CMU_ISR_HFDETO_Msk

#define    CMU_ISR_LFDETO_Pos                                     (8U)
#define    CMU_ISR_LFDETO_Msk                                     (0x1U << CMU_ISR_LFDETO_Pos)
#define    CMU_ISR_LFDETO                                         CMU_ISR_LFDETO_Msk

#define    CMU_ISR_LOLIF_Pos                                      (3U)
#define    CMU_ISR_LOLIF_Msk                                      (0x1U << CMU_ISR_LOLIF_Pos)
#define    CMU_ISR_LOLIF                                          CMU_ISR_LOLIF_Msk

#define    CMU_ISR_SYSCSE_IF_Pos                                  (2U)
#define    CMU_ISR_SYSCSE_IF_Msk                                  (0x1U << CMU_ISR_SYSCSE_IF_Pos)
#define    CMU_ISR_SYSCSE_IF                                      CMU_ISR_SYSCSE_IF_Msk

#define    CMU_ISR_HFDET_IF_Pos                                   (1U)
#define    CMU_ISR_HFDET_IF_Msk                                   (0x1U << CMU_ISR_HFDET_IF_Pos)
#define    CMU_ISR_HFDET_IF                                       CMU_ISR_HFDET_IF_Msk

#define    CMU_ISR_LFDET_IF_Pos                                   (0U)
#define    CMU_ISR_LFDET_IF_Msk                                   (0x1U << CMU_ISR_LFDET_IF_Pos)
#define    CMU_ISR_LFDET_IF                                       CMU_ISR_LFDET_IF_Msk

#define    CMU_OPCCR1_EXTICKS_Pos                                 (30U)
#define    CMU_OPCCR1_EXTICKS_Msk                                 (0x1U << CMU_OPCCR1_EXTICKS_Pos)
#define    CMU_OPCCR1_EXTICKS                                     CMU_OPCCR1_EXTICKS_Msk

#define    CMU_OPCCR1_UART3CKS_Pos                                (28U)
#define    CMU_OPCCR1_UART3CKS_Msk                                (0x3U << CMU_OPCCR1_UART3CKS_Pos)
#define    CMU_OPCCR1_UART3CKS                                    CMU_OPCCR1_UART3CKS_Msk

#define    CMU_OPCCR1_LPUART2CKS_Pos                              (26U)
#define    CMU_OPCCR1_LPUART2CKS_Msk                              (0x3U << CMU_OPCCR1_LPUART2CKS_Pos)
#define    CMU_OPCCR1_LPUART2CKS                                  CMU_OPCCR1_LPUART2CKS_Msk

#define    CMU_OPCCR1_LPUART1CKS_Pos                              (24U)
#define    CMU_OPCCR1_LPUART1CKS_Msk                              (0x3U << CMU_OPCCR1_LPUART1CKS_Pos)
#define    CMU_OPCCR1_LPUART1CKS                                  CMU_OPCCR1_LPUART1CKS_Msk

#define    CMU_OPCCR1_LPUART0CKS_Pos                              (22U)
#define    CMU_OPCCR1_LPUART0CKS_Msk                              (0x3U << CMU_OPCCR1_LPUART0CKS_Pos)
#define    CMU_OPCCR1_LPUART0CKS                                  CMU_OPCCR1_LPUART0CKS_Msk

#define    CMU_OPCCR1_UART2CKS_Pos                                (20U)
#define    CMU_OPCCR1_UART2CKS_Msk                                (0x3U << CMU_OPCCR1_UART2CKS_Pos)
#define    CMU_OPCCR1_UART2CKS                                    CMU_OPCCR1_UART2CKS_Msk

#define    CMU_OPCCR1_I2CSMB1CKS_Pos                              (18U)
#define    CMU_OPCCR1_I2CSMB1CKS_Msk                              (0x3U << CMU_OPCCR1_I2CSMB1CKS_Pos)
#define    CMU_OPCCR1_I2CSMB1CKS                                  CMU_OPCCR1_I2CSMB1CKS_Msk

#define    CMU_OPCCR1_I2CSMB0CKS_Pos                              (16U)
#define    CMU_OPCCR1_I2CSMB0CKS_Msk                              (0x3U << CMU_OPCCR1_I2CSMB0CKS_Pos)
#define    CMU_OPCCR1_I2CSMB0CKS                                  CMU_OPCCR1_I2CSMB0CKS_Msk

#define    CMU_OPCCR1_BT16CKS_Pos                                 (14U)
#define    CMU_OPCCR1_BT16CKS_Msk                                 (0x3U << CMU_OPCCR1_BT16CKS_Pos)
#define    CMU_OPCCR1_BT16CKS                                     CMU_OPCCR1_BT16CKS_Msk

#define    CMU_OPCCR1_BT32CKS_Pos                                 (12U)
#define    CMU_OPCCR1_BT32CKS_Msk                                 (0x3U << CMU_OPCCR1_BT32CKS_Pos)
#define    CMU_OPCCR1_BT32CKS                                     CMU_OPCCR1_BT32CKS_Msk

#define    CMU_OPCCR1_LPT16CKS_Pos                                (10U)
#define    CMU_OPCCR1_LPT16CKS_Msk                                (0x3U << CMU_OPCCR1_LPT16CKS_Pos)
#define    CMU_OPCCR1_LPT16CKS                                    CMU_OPCCR1_LPT16CKS_Msk

#define    CMU_OPCCR1_LPT32CKS_Pos                                (8U)
#define    CMU_OPCCR1_LPT32CKS_Msk                                (0x3U << CMU_OPCCR1_LPT32CKS_Pos)
#define    CMU_OPCCR1_LPT32CKS                                    CMU_OPCCR1_LPT32CKS_Msk

#define    CMU_OPCCR1_ATCKS_Pos                                   (7U)
#define    CMU_OPCCR1_ATCKS_Msk                                   (0x1U << CMU_OPCCR1_ATCKS_Pos)
#define    CMU_OPCCR1_ATCKS                                       CMU_OPCCR1_ATCKS_Msk

#define    CMU_OPCCR1_FSCANCKS_Pos                                (4U)
#define    CMU_OPCCR1_FSCANCKS_Msk                                (0x3U << CMU_OPCCR1_FSCANCKS_Pos)
#define    CMU_OPCCR1_FSCANCKS                                    CMU_OPCCR1_FSCANCKS_Msk

#define    CMU_OPCCR1_UART1CKS_Pos                                (2U)
#define    CMU_OPCCR1_UART1CKS_Msk                                (0x3U << CMU_OPCCR1_UART1CKS_Pos)
#define    CMU_OPCCR1_UART1CKS                                    CMU_OPCCR1_UART1CKS_Msk

#define    CMU_OPCCR1_UART0CKS_Pos                                (0U)
#define    CMU_OPCCR1_UART0CKS_Msk                                (0x3U << CMU_OPCCR1_UART0CKS_Pos)
#define    CMU_OPCCR1_UART0CKS                                    CMU_OPCCR1_UART0CKS_Msk

#define    CMU_OPCCR2_RTCPRSC_Pos                                 (22U)
#define    CMU_OPCCR2_RTCPRSC_Msk                                 (0x3ffU << CMU_OPCCR2_RTCPRSC_Pos)
#define    CMU_OPCCR2_RTCPRSC                                     CMU_OPCCR2_RTCPRSC_Msk

#define    CMU_OPCCR2_RTCCKS_Pos                                  (16U)
#define    CMU_OPCCR2_RTCCKS_Msk                                  (0x1U << CMU_OPCCR2_RTCCKS_Pos)
#define    CMU_OPCCR2_RTCCKS                                      CMU_OPCCR2_RTCCKS_Msk

#define    CMU_OPCCR2_RNGPRSC_Pos                                 (10U)
#define    CMU_OPCCR2_RNGPRSC_Msk                                 (0x7U << CMU_OPCCR2_RNGPRSC_Pos)
#define    CMU_OPCCR2_RNGPRSC                                     CMU_OPCCR2_RNGPRSC_Msk

#define    CMU_OPCCR2_ADCPRSC_Pos                                 (2U)
#define    CMU_OPCCR2_ADCPRSC_Msk                                 (0x7U << CMU_OPCCR2_ADCPRSC_Pos)
#define    CMU_OPCCR2_ADCPRSC                                     CMU_OPCCR2_ADCPRSC_Msk

#define    CMU_OPCCR2_ADCCKS_Pos                                  (0U)
#define    CMU_OPCCR2_ADCCKS_Msk                                  (0x3U << CMU_OPCCR2_ADCCKS_Pos)
#define    CMU_OPCCR2_ADCCKS                                      CMU_OPCCR2_ADCCKS_Msk

/* ALL SUPPOTRED EXCEPT CHIP U01. START */
#define    CMU_AHBMCR_LOL_IE_Pos                                  (30U)
#define    CMU_AHBMCR_LOL_IE_Msk                                  (0x1U << CMU_AHBMCR_LOL_IE_Pos)
#define    CMU_AHBMCR_LOL_IE                                      CMU_AHBMCR_LOL_IE_Msk
/* ALL SUPPOTRED EXCEPT CHIP U01. END */

#define    CMU_AHBMCR_MPRIL_Pos                                   (0U)
#define    CMU_AHBMCR_MPRIL_Msk                                   (0x1U << CMU_AHBMCR_MPRIL_Pos)
#define    CMU_AHBMCR_MPRIL                                       CMU_AHBMCR_MPRIL_Msk

#define    CMU_CFDCR_CANFD1CKS_Pos                                (6U)
#define    CMU_CFDCR_CANFD1CKS_Msk                                (0x3U << CMU_CFDCR_CANFD1CKS_Pos)
#define    CMU_CFDCR_CANFD1CKS                                    CMU_CFDCR_CANFD1CKS_Msk

