zmzdh/CAN_st_test/Drivers/Drivers/FM33FG0xxA_FL_Driver/Inc/fm33fg0xxa_fl_cmu.h
#define    CMU_CFDCR_CANFD1CKRS_Pos                               (4U)
#define    CMU_CFDCR_CANFD1CKRS_Msk                               (0x3U << CMU_CFDCR_CANFD1CKRS_Pos)
#define    CMU_CFDCR_CANFD1CKRS                                   CMU_CFDCR_CANFD1CKRS_Msk

#define    CMU_CFDCR_CANFD0CKS_Pos                                (2U)
#define    CMU_CFDCR_CANFD0CKS_Msk                                (0x3U << CMU_CFDCR_CANFD0CKS_Pos)
#define    CMU_CFDCR_CANFD0CKS                                    CMU_CFDCR_CANFD0CKS_Msk

#define    CMU_CFDCR_CANFD0CKRS_Pos                               (0U)
#define    CMU_CFDCR_CANFD0CKRS_Msk                               (0x3U << CMU_CFDCR_CANFD0CKRS_Pos)
#define    CMU_CFDCR_CANFD0CKRS                                   CMU_CFDCR_CANFD0CKRS_Msk



#define    FL_CMU_GROUP1_BUSCLK_LPTIM32                           (0x1U << 0U)
#define    FL_CMU_GROUP1_BUSCLK_LPTIM16                           (0x1U << 1U)
#define    FL_CMU_GROUP1_BUSCLK_RTC                               (0x1U << 2U)
#define    FL_CMU_GROUP1_BUSCLK_PMU                               (0x1U << 3U)
#define    FL_CMU_GROUP1_BUSCLK_SCU                               (0x1U << 4U)
#define    FL_CMU_GROUP1_BUSCLK_IWDT                              (0x1U << 5U)
#define    FL_CMU_GROUP1_BUSCLK_ANAC                              (0x1U << 6U)
#define    FL_CMU_GROUP1_BUSCLK_PAD                               (0x1U << 7U)
#define    FL_CMU_GROUP1_BUSCLK_SVD                               (0x1U << 8U)
#define    FL_CMU_GROUP1_BUSCLK_COMP                              (0x1U << 9U)
#define    FL_CMU_GROUP1_BUSCLK_CLM0                              (0x1U << 10U)
#define    FL_CMU_GROUP1_BUSCLK_CLM1                              (0x1U << 11U)
#define    FL_CMU_GROUP2_BUSCLK_CRC                               (0x1U << 0U)
#define    FL_CMU_GROUP2_BUSCLK_RNG                               (0x1U << 1U)
#define    FL_CMU_GROUP2_BUSCLK_AES                               (0x1U << 2U)
#define    FL_CMU_GROUP2_BUSCLK_DMA                               (0x1U << 4U)
#define    FL_CMU_GROUP2_BUSCLK_FLASH                             (0x1U << 5U)
#define    FL_CMU_GROUP2_BUSCLK_RAMBIST                           (0x1U << 6U)
#define    FL_CMU_GROUP2_BUSCLK_WWDT                              (0x1U << 7U)
#define    FL_CMU_GROUP2_BUSCLK_ADC                               (0x1U << 8U)
#define    FL_CMU_GROUP2_BUSCLK_HDIV                              (0x1U << 9U)
#define    FL_CMU_GROUP2_BUSCLK_DAC                               (0x1U << 10U)
#define    FL_CMU_GROUP2_BUSCLK_PGL                               (0x1U << 11U)
#define    FL_CMU_GROUP3_BUSCLK_SPI0                              (0x1U << 0U)
#define    FL_CMU_GROUP3_BUSCLK_SPI1                              (0x1U << 1U)
#define    FL_CMU_GROUP3_BUSCLK_SPI2                              (0x1U << 2U)
#define    FL_CMU_GROUP3_BUSCLK_SPI3                              (0x1U << 3U)
#define    FL_CMU_GROUP3_BUSCLK_UART0                             (0x1U << 8U)
#define    FL_CMU_GROUP3_BUSCLK_UART1                             (0x1U << 9U)
#define    FL_CMU_GROUP3_BUSCLK_UART2                             (0x1U << 10U)
#define    FL_CMU_GROUP3_BUSCLK_UART3                             (0x1U << 11U)
#define    FL_CMU_GROUP3_BUSCLK_UART4                             (0x1U << 12U)
#define    FL_CMU_GROUP3_BUSCLK_UART5                             (0x1U << 13U)
#define    FL_CMU_GROUP3_BUSCLK_UARTIR                            (0x1U << 14U)
#define    FL_CMU_GROUP3_BUSCLK_LPUART0                           (0x1U << 16U)
#define    FL_CMU_GROUP3_BUSCLK_LPUART1                           (0x1U << 17U)
#define    FL_CMU_GROUP3_BUSCLK_LPUART2                           (0x1U << 18U)
#define    FL_CMU_GROUP3_BUSCLK_FSCAN                             (0x1U << 19U)
#define    FL_CMU_GROUP3_BUSCLK_CANFD0                            (0x1U << 22U)
#define    FL_CMU_GROUP3_BUSCLK_CANFD1                            (0x1U << 23U)
#define    FL_CMU_GROUP3_BUSCLK_I2C0                              (0x1U << 24U)
#define    FL_CMU_GROUP3_BUSCLK_I2C1                              (0x1U << 25U)
#define    FL_CMU_GROUP3_BUSCLK_I2CSMB0                           (0x1U << 28U)
#define    FL_CMU_GROUP3_BUSCLK_I2CSMB1                           (0x1U << 29U)
#define    FL_CMU_GROUP3_BUSCLK_SENT0                             (0x1U << 30U)
#define    FL_CMU_GROUP3_BUSCLK_SENT1                             (0x1U << 31U)
#define    FL_CMU_GROUP4_BUSCLK_BSTIM32                           (0x1U << 0U)
#define    FL_CMU_GROUP4_BUSCLK_GPTIM0                            (0x1U << 1U)
#define    FL_CMU_GROUP4_BUSCLK_GPTIM1                            (0x1U << 2U)
#define    FL_CMU_GROUP4_BUSCLK_GPTIM2                            (0x1U << 3U)
#define    FL_CMU_GROUP4_BUSCLK_TAU0                              (0x1U << 4U)
#define    FL_CMU_GROUP4_BUSCLK_TAU1                              (0x1U << 5U)
#define    FL_CMU_GROUP4_BUSCLK_ATIM                              (0x1U << 7U)
#define    FL_CMU_GROUP4_BUSCLK_BSTIM16                           (0x1U << 8U)
#define    FL_CMU_OPCLK_EXTI                                      (0x1U << 31U)
#define    FL_CMU_OPCLK_FLASH                                     (0x1U << 30U)
#define    FL_CMU_OPCLK_LPUART0                                   (0x1U << 29U)
#define    FL_CMU_OPCLK_LPUART1                                   (0x1U << 28U)
#define    FL_CMU_OPCLK_LPUART2                                   (0x1U << 27U)
#define    FL_CMU_OPCLK_RNG                                       (0x1U << 24U)
#define    FL_CMU_OPCLK_I2CSMB1                                   (0x1U << 21U)
#define    FL_CMU_OPCLK_I2CSMB0                                   (0x1U << 20U)
#define    FL_CMU_OPCLK_ADC                                       (0x1U << 16U)
#define    FL_CMU_OPCLK_ATIM                                      (0x1U << 15U)
#define    FL_CMU_OPCLK_FSCAN                                     (0x1U << 13U)
#define    FL_CMU_OPCLK_LIN                                       (0x1U << 12U)
#define    FL_CMU_OPCLK_UART3                                     (0x1U << 11U)
#define    FL_CMU_OPCLK_UART2                                     (0x1U << 10U)
#define    FL_CMU_OPCLK_UART1                                     (0x1U << 9U)
#define    FL_CMU_OPCLK_UART0                                     (0x1U << 8U)
#define    FL_CMU_OPCLK_BSTIM16                                   (0x1U << 3U)
#define    FL_CMU_OPCLK_BSTIM32                                   (0x1U << 2U)
#define    FL_CMU_OPCLK_LPTIM16                                   (0x1U << 1U)
#define    FL_CMU_OPCLK_LPTIM32                                   (0x1U << 0U)
#define    FL_CMU_OPCLK_CANFD1_COMM                               (0x1U << 5U)
#define    FL_CMU_OPCLK_CANFD1_RAM                                (0x1U << 4U)
#define    FL_CMU_OPCLK_CANFD0_COMM                               (0x1U << 1U)
#define    FL_CMU_OPCLK_CANFD0_RAM                                (0x1U << 0U)



#define    FL_CMU_APB2CLK_PSC_DIV1                                (0x0U << CMU_SYSCLKCR_APB2PRES_Pos)
#define    FL_CMU_APB2CLK_PSC_DIV2                                (0x4U << CMU_SYSCLKCR_APB2PRES_Pos)
#define    FL_CMU_APB2CLK_PSC_DIV4                                (0x5U << CMU_SYSCLKCR_APB2PRES_Pos)
#define    FL_CMU_APB2CLK_PSC_DIV8                                (0x6U << CMU_SYSCLKCR_APB2PRES_Pos)
#define    FL_CMU_APB2CLK_PSC_DIV16                               (0x7U << CMU_SYSCLKCR_APB2PRES_Pos)


#define    FL_CMU_APB1CLK_PSC_DIV1                                (0x0U << CMU_SYSCLKCR_APB1PRES_Pos)
#define    FL_CMU_APB1CLK_PSC_DIV2                                (0x4U << CMU_SYSCLKCR_APB1PRES_Pos)
#define    FL_CMU_APB1CLK_PSC_DIV4                                (0x5U << CMU_SYSCLKCR_APB1PRES_Pos)
#define    FL_CMU_APB1CLK_PSC_DIV8                                (0x6U << CMU_SYSCLKCR_APB1PRES_Pos)
#define    FL_CMU_APB1CLK_PSC_DIV16                               (0x7U << CMU_SYSCLKCR_APB1PRES_Pos)


#define    FL_CMU_AHBCLK_PSC_DIV1                                 (0x0U << CMU_SYSCLKCR_AHBPRES_Pos)
#define    FL_CMU_AHBCLK_PSC_DIV2                                 (0x4U << CMU_SYSCLKCR_AHBPRES_Pos)
#define    FL_CMU_AHBCLK_PSC_DIV4                                 (0x5U << CMU_SYSCLKCR_AHBPRES_Pos)
#define    FL_CMU_AHBCLK_PSC_DIV8                                 (0x6U << CMU_SYSCLKCR_AHBPRES_Pos)
#define    FL_CMU_AHBCLK_PSC_DIV16                                (0x7U << CMU_SYSCLKCR_AHBPRES_Pos)


#define    FL_CMU_SYSTICK_CLK_SOURCE_SCLK                         (0x0U << CMU_SYSCLKCR_STCLKSEL_Pos)
#define    FL_CMU_SYSTICK_CLK_SOURCE_LSCLK                        (0x1U << CMU_SYSCLKCR_STCLKSEL_Pos)


