zmzdh/CAN_st_test/Drivers/Drivers/FM33FG0xxA_FL_Driver/Inc/fm33fg0xxa_fl_cmu.h
/**
  * @brief    Set CANFD1 Clock Source
  * @rmtoll   CFDCR    CANFD1CKS    FL_CMU_SetCANFD1ClockSource
  * @param    clock This parameter can be one of the following values:
  *           @arg @ref FL_CMU_CANFD1_CLK_SOURCE_APBCLK
  *           @arg @ref FL_CMU_CANFD1_CLK_SOURCE_XTHF
  *           @arg @ref FL_CMU_CANFD1_CLK_SOURCE_PLL
  *           @arg @ref FL_CMU_CANFD1_CLK_SOURCE_RCHF
  * @retval   None
  */
__STATIC_INLINE void FL_CMU_SetCANFD1ClockSource(uint32_t clock)
{
    MODIFY_REG(CMU->CFDCR, CMU_CFDCR_CANFD1CKS_Msk, clock);
}

/**
  * @brief    Get CANFD1 Clock Source Setting
  * @rmtoll   CFDCR    CANFD1CKS    FL_CMU_GetCANFD1ClockSource
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_CMU_CANFD1_CLK_SOURCE_APBCLK
  *           @arg @ref FL_CMU_CANFD1_CLK_SOURCE_XTHF
  *           @arg @ref FL_CMU_CANFD1_CLK_SOURCE_PLL
  *           @arg @ref FL_CMU_CANFD1_CLK_SOURCE_RCHF
  */
__STATIC_INLINE uint32_t FL_CMU_GetCANFD1ClockSource(void)
{
    return (uint32_t)(READ_BIT(CMU->CFDCR, CMU_CFDCR_CANFD1CKS_Msk));
}

/**
  * @brief    Set CANFD1 Clock Source RAM 
  * @rmtoll   CFDCR    CANFD1CKRS    FL_CMU_SetCANFD1ClockSourceRam
  * @param    clock This parameter can be one of the following values:
  *           @arg @ref FL_CMU_CANFD1_CLK_SOURCE_RAM_AHBCLK
  *           @arg @ref FL_CMU_CANFD1_CLK_SOURCE_RAM_PLL_VCO
  * @retval   None
  */
__STATIC_INLINE void FL_CMU_SetCANFD1ClockSourceRam(uint32_t clock)
{
    MODIFY_REG(CMU->CFDCR, CMU_CFDCR_CANFD1CKRS_Msk, clock);
}

/**
  * @brief    Set CANFD1 Clock Source RAM 
  * @rmtoll   CFDCR    CANFD1CKRS    FL_CMU_GetCANFD1ClockSourceRam
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_CMU_CANFD1_CLK_SOURCE_RAM_AHBCLK
  *           @arg @ref FL_CMU_CANFD1_CLK_SOURCE_RAM_PLL_VCO
  */
__STATIC_INLINE uint32_t FL_CMU_GetCANFD1ClockSourceRam(void)
{
    return (uint32_t)(READ_BIT(CMU->CFDCR, CMU_CFDCR_CANFD1CKRS_Msk));
}

/**
  * @brief    Set CANFD0 Clock Source
  * @rmtoll   CFDCR    CANFD0CKS    FL_CMU_SetCANFD0ClockSource
  * @param    clock This parameter can be one of the following values:
  *           @arg @ref FL_CMU_CANFD0_CLK_SOURCE_APBCLK
  *           @arg @ref FL_CMU_CANFD0_CLK_SOURCE_XTHF
  *           @arg @ref FL_CMU_CANFD0_CLK_SOURCE_PLL
  *           @arg @ref FL_CMU_CANFD0_CLK_SOURCE_RCHF
  * @retval   None
  */
__STATIC_INLINE void FL_CMU_SetCANFD0ClockSource(uint32_t clock)
{
    MODIFY_REG(CMU->CFDCR, CMU_CFDCR_CANFD0CKS_Msk, clock);
}

/**
  * @brief    Get CANFD0 Clock Source Setting
  * @rmtoll   CFDCR    CANFD0CKS    FL_CMU_GetCANFD0ClockSource
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_CMU_CANFD0_CLK_SOURCE_APBCLK
  *           @arg @ref FL_CMU_CANFD0_CLK_SOURCE_XTHF
  *           @arg @ref FL_CMU_CANFD0_CLK_SOURCE_PLL
  *           @arg @ref FL_CMU_CANFD0_CLK_SOURCE_RCHF
  */
__STATIC_INLINE uint32_t FL_CMU_GetCANFD0ClockSource(void)
{
    return (uint32_t)(READ_BIT(CMU->CFDCR, CMU_CFDCR_CANFD0CKS_Msk));
}

/**
  * @brief    Set CANFD0 Clock Source RAM 
  * @rmtoll   CFDCR    CANFD0CKRS    FL_CMU_SetCANFD0ClockSourceRam
  * @param    clock This parameter can be one of the following values:
  *           @arg @ref FL_CMU_CANFD0_CLK_SOURCE_RAM_AHBCLK
  *           @arg @ref FL_CMU_CANFD0_CLK_SOURCE_RAM_PLL_VCO
  * @retval   None
  */
__STATIC_INLINE void FL_CMU_SetCANFD0ClockSourceRam(uint32_t clock)
{
    MODIFY_REG(CMU->CFDCR, CMU_CFDCR_CANFD0CKRS_Msk, clock);
}

/**
  * @brief    Set CANFD0 Clock Source RAM 
  * @rmtoll   CFDCR    CANFD0CKRS    FL_CMU_GetCANFD0ClockSourceRam
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_CMU_CANFD0_CLK_SOURCE_RAM_AHBCLK
  *           @arg @ref FL_CMU_CANFD0_CLK_SOURCE_RAM_PLL_VCO
  */
__STATIC_INLINE uint32_t FL_CMU_GetCANFD0ClockSourceRam(void)
{
    return (uint32_t)(READ_BIT(CMU->CFDCR, CMU_CFDCR_CANFD0CKRS_Msk));
}

/**
  * @}
  */

/** @defgroup CMU_FL_EF_Init Initialization and de-initialization functions
  * @{
  */

FL_ErrorStatus FL_CMU_SetSystemClock(FL_SystemClock systemClock);

uint32_t FL_CMU_GetPLLClockFreq(void);
uint32_t FL_CMU_GetRCHFClockFreq(void);
uint32_t FL_CMU_GetSystemClockFreq(void);
uint32_t FL_CMU_GetAPB2ClockFreq(void);
uint32_t FL_CMU_GetAPB1ClockFreq(void);
uint32_t FL_CMU_GetAHBClockFreq(void);

/**
  * @}
  */


/**
  * @}
  */

#ifdef __cplusplus
}
#endif

#endif /* __FM33FG0XXA_FL_CMU_H*/

/*************************Py_Code_Generator Version: 0.1-0.14-0.1 @ 2023-07-07*************************/
/*************************(C) COPYRIGHT Fudan Microelectronics **** END OF FILE*************************/
